In [1]:
import numpy as np
import pandas as pd

In [2]:
my_dictionary = {"Hans" : [40,30,np.nan], "Sam" : [20,np.nan,50], "Coni" : [30,50,40]}

In [3]:
my_data_frame = pd.DataFrame(my_dictionary)

In [4]:
my_data_frame

   Hans   Sam  Coni
0  40.0  20.0    30
1  30.0   NaN    50
2   NaN  50.0    40

In [5]:
my_data_frame.dropna()

   Hans   Sam  Coni
0  40.0  20.0    30

In [6]:
my_data_frame

   Hans   Sam  Coni
0  40.0  20.0    30
1  30.0   NaN    50
2   NaN  50.0    40

In [7]:
my_data_frame.dropna(axis=1)

   Coni
0    30
1    50
2    40

In [8]:
my_data_frame

   Hans   Sam  Coni
0  40.0  20.0    30
1  30.0   NaN    50
2   NaN  50.0    40

In [9]:
my_new_dictionary = {"Hans" : [40,30,np.nan], "Sam" : [20,np.nan,50], "Coni" : [30,50,40], "Toni" : [40,np.nan,np.nan]}

In [10]:
my_new_data_frame = pd.DataFrame(my_new_dictionary)

In [11]:
my_new_data_frame

   Hans   Sam  Coni  Toni
0  40.0  20.0    30  40.0
1  30.0   NaN    50   NaN
2   NaN  50.0    40   NaN

In [12]:
my_new_data_frame.dropna(axis=1,thresh=2)

   Hans   Sam  Coni
0  40.0  20.0    30
1  30.0   NaN    50
2   NaN  50.0    40

In [13]:
my_new_data_frame.fillna(20)

   Hans   Sam  Coni  Toni
0  40.0  20.0    30  40.0
1  30.0  20.0    50  20.0
2  20.0  50.0    40  20.0

In [14]:
#groupby

In [15]:
salary_dict = {"Programming Language" : ["Python","Swift","Python","C/C++","C/C++","Swift"], "Name" : ["A","B","C","D","E","F"], "Salary" : [100,90,80,70,60,50]}

In [16]:
salary_frame = pd.DataFrame(salary_dict)

In [17]:
salary_frame

  Programming Language Name  Salary
0               Python    A     100
1                Swift    B      90
2               Python    C      80
3                C/C++    D      70
4                C/C++    E      60
5                Swift    F      50

In [18]:
group_object = salary_frame.groupby("Programming Language")

In [19]:
group_object.count()

                      Name  Salary
Programming Language
C/C++                    2       2
Python                   2       2
Swift                    2       2

In [20]:
group_object.mean()

                      Salary
Programming Language
C/C++                   65.0
Python                  90.0
Swift                   70.0

In [21]:
group_object.min("Salary")

                      Salary
Programming Language
C/C++                     60
Python                    80
Swift                     50

In [22]:
group_object.max("Salary")

                      Salary
Programming Language
C/C++                     70
Python                   100
Swift                     90

In [23]:
group_object.max(numeric_only=True)

                      Salary
Programming Language
C/C++                     70
Python                   100
Swift                     90

In [24]:
group_object.describe()

                     Salary
                      count  mean        std   min   25%   50%   75%    max
Programming Language
C/C++                   2.0  65.0   7.071068  60.0  62.5  65.0  67.5   70.0
Python                  2.0  90.0  14.142136  80.0  85.0  90.0  95.0  100.0
Swift                   2.0  70.0  28.284271  50.0  60.0  70.0  80.0   90.0

In [25]:
my_dict1 = {"Name" : ["A","B","C","D"],
           "Sport" : ["Basketball","Football","Tennis","Running"],
           "Calories": [100,200,300,400]}

In [26]:
my_frame1 = pd.DataFrame(my_dict1, index=[0,1,2,3])

In [27]:
my_frame1

  Name       Sport  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [28]:
my_dict2 = {"Name" : ["E","F","G","H"],
           "Sport" : ["Basketball","Football","Tennis","Running"],
           "Calories": [200,250,340,440]}

In [29]:
my_frame2 = pd.DataFrame(my_dict2, index=[4,5,6,7])

In [30]:
my_frame2

  Name       Sport  Calories
4    E  Basketball       200
5    F    Football       250
6    G      Tennis       340
7    H     Running       440

In [31]:
my_dict3 = {"Name" : ["I","J","K","L"],
           "Sport" : ["Basketball","Football","Tennis","Running"],
           "Calories": [150,300,240,340]}

In [32]:
my_frame3 = pd.DataFrame(my_dict3, index=[8,9,10,11])

In [33]:
my_frame3

   Name       Sport  Calories
8     I  Basketball       150
9     J    Football       300
10    K      Tennis       240
11    L     Running       340

In [34]:
#concatenation

In [35]:
pd.concat([my_frame1,my_frame2,my_frame3])

   Name       Sport  Calories
0     A  Basketball       100
1     B    Football       200
2     C      Tennis       300
3     D     Running       400
4     E  Basketball       200
5     F    Football       250
6     G      Tennis       340
7     H     Running       440
8     I  Basketball       150
9     J    Football       300
10    K      Tennis       240
11    L     Running       340

In [36]:
#merge

In [37]:
my_frame1

  Name       Sport  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [38]:
my_frame2

  Name       Sport  Calories
4    E  Basketball       200
5    F    Football       250
6    G      Tennis       340
7    H     Running       440

In [39]:
pd.merge(my_frame1,my_frame2,on="Sport")

  Name_x       Sport  Calories_x Name_y  Calories_y
0      A  Basketball         100      E         200
1      B    Football         200      F         250
2      C      Tennis         300      G         340
3      D     Running         400      H         440

In [40]:
new_salary_frame = pd.DataFrame({"Name" : ["Hans","Sam","Herkel"],
                                "Salary" : [10,20,30],
                                "Age" : [60,65,70]})

In [41]:
new_salary_frame

     Name  Salary  Age
0    Hans      10   60
1     Sam      20   65
2  Herkel      30   70

In [42]:
new_salary_frame["Name"].unique()

array(['Hans', 'Sam', 'Herkel'], dtype=object)

In [43]:
new_salary_frame["Name"].nunique()

3

In [44]:
def grossToNet(Salary):
    return Salary * 0.65

In [45]:
new_salary_frame["Salary"].apply(grossToNet)

0     6.5
1    13.0
2    19.5
Name: Salary, dtype: float64